{
  "@metadata": {
    "authors": [
      "Marijn van Wezel <xxmarijnw>"
    ]
  },
  "wsoauth-extensionname": "WSOAuth",
  "wsoauth-desc": "Zorgt voor authenticatie met behulp van OAuth in combinatie met PluggableAuth.",
  "wsoauth-pluggable-auth-class-desc": "De naam van de class die PluggableAuth extend; deze configuratie parameter wordt door de extensie ingesteld en zou niet door de gebruiker aan moeten worden gepast.",
  "wsoauth-uri-desc": "De OAuth authenticatie URL.",
  "wsoauth-client-id-desc": "De consumer sleutel ontvangen van de OAuth-provider.",
  "wsoauth-client-secret-desc": "De consumer secret ontvangen van de OAuth-provider.",
  "wsoauth-redirect-uri-desc": "De standaard terugkeer URL waarheen de OAuth-provider de gebruiker zal sturen nadat deze succesvol is geauthenticeerd.",
  "wsoauth-auth-providers-desc": "Een lijst (array) met alle niet-standaard authenticatieleveranciers samen met de naam van hun class.",
  "wsoauth-auth-provider-desc": "De authenticatieleverancier waarvan de extensie gebruik moet maken.",
  "wsoauth-auto-populate-groups-desc": "Een lijst (array) met MediaWiki groepen die automatisch aan de gebruiker worden toegewezen nadat deze successvol is geauthenticeerd.",
  "wsoauth-pluggable-auth-button-label-message-desc": "De naam van de system message dat gebruikt wordt als label op de login button op de Special:UserLogin pagina.",
  "wsoauth-pluggable-auth-button-label-message": "Log in met OAuth",
  "wsoauth-authentication-failure": "Authenticatie mislukt (bent u geauthoriseerd voor deze wiki?).",
  "wsoauth-invalid-username": "Gebruikersnaam verstrekt door de OAuth-provider is niet geldig.",
  "wsoauth-unknown-auth-provider-class-exception-message": "OAuth-provider class niet gevonden of geladen",
  "wsoauth-unknown-auth-provider-exception-message": "Onbekende OAuth-provider ($1)",
  "wsoauth-invalid-auth-provider-class-exception-message": "De OAuth-provider class is geen implementatie van AuthProvider",
  "wsoauth-initiate-login-failure": "Kan communicatie met OAuth-provider niet starten."
}